vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
//     // // Apply the new firmware and reboot
//     // ota_apply();
//     // bl_sys_reset();  // Reboot the device

//     return ERR_OK;
// }

#define MAX_BUFFER_SIZE 1024

err_t httpd_handler(struct netconn *conn) {
    struct netbuf *inbuf;
    char *buf;
    u16_t buflen;

    // Receive HTTP request
    if (netconn_recv(conn, &inbuf) == ERR_OK) {
        netbuf_data(inbuf, (void **)&buf, &buflen);
        
        printf("HTTP Length: %i\n", buflen);
        printf("HTTP Request: %s\n\n", buf);

        // Check if the request is a POST (for file upload)
        if (strncmp(buf, "POST ", 5) == 0) {
            puts("[httpd_handler] Handling POST request...\n");
            int content_length = 0;
            // Parse Content-Length header
            char *content_length_str = strstr(buf, "Content-Length:");
            if (content_length_str) {
                sscanf(content_length_str, "Content-Length: %d", &content_length);
                printf("Content-Length header found: %d\n", content_length);
            } else {
                puts("Content-Length header not found\n");
            }
            if(strncmp(buf, "POST /ota", 9) == 0) {
                netbuf_delete(inbuf);
                puts("[httpd_handler] Handling firmware upload...\n");
                // I KNOW I'M SENDING the firmware now
                // Parse and handle the firmware data
                if (http_rest_post_flash(conn, content_length) != ERR_OK) {
                    const char *error_response =
                        "HTTP/1.1 500 Internal Server Error\r\n"
                        "Connection: close\r\n\r\n"
                        "Failed to process firmware upload.";
                    netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
                } else {
                    const char *success_response =
                        "HTTP/1.1 200 OK\r\n"
                        "Connection: close\r\n\r\n"
                        "Firmware uploaded successfully.";
                    netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
                }
            } else if (strncmp(buf, "POST /wifi", 10) == 0) {
                puts("[httpd_handler] Handling wifi settings request...\n");
                char* body = malloc(content_length + 1);
                char* body_start = strstr(buf, "\r\n\r\n");
                body_start += 4;
                char* body_end = buf + buflen;
                int total_length = body_end - body_start;
                printf("Total length: %i\r\n", total_length);
                memcpy(body, body_start, total_length);
                netbuf_delete(inbuf);
                if (netconn_recv(conn, &inbuf) == ERR_OK) {
                    puts("Got additional data\r\n");
                    netbuf_data(inbuf, (void **)&buf, &buflen);
                    printf("Additional data length: %i\r\n", buflen);
                    memcpy(body + total_length, buf, buflen);
                }
                body[content_length] = '\0';
                printf("Body: %s\r\n", body);
                if (http_rest_post_wifi(body) != ERR_OK) {
                    const char *error_response =
                        "HTTP/1.1 500 Internal Server Error\r\n"
                        "Connection: close\r\n\r\n"
                        "Failed to process new wifi settings.";
                    netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
                } else {
                    const char *success_response =
                        "HTTP/1.1 200 OK\r\n"
                        "Connection: close\r\n\r\n"
                        "Changed wifi settings.";
                    netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
                }
                netbuf_delete(inbuf);
                free(body);
            } else netbuf_delete(inbuf);
        } else {
            // Default response (serves an HTML page)
            const char *response =
                "HTTP/1.1 200 OK\r\n"
                "Content-Type: text/html\r\n"
                "Connection: close\r\n\r\n";
            netconn_write(conn, response, strlen(response), NETCONN_COPY);
            netconn_write(conn, html_page, strlen(html_page), NETCONN_COPY);
            netbuf_delete(inbuf);
        }
    }

    // Close and delete the connection
    netconn_close(conn);

    return ERR_OK;
}

// Start the HTTP server
void http_server(void) {
    struct netconn *conn, *newconn;
    puts("[http_server] Starting...\r\n");
    // Create a new TCP connection
    conn = netconn_new(NETCONN_TCP);
    netconn_bind(conn, IP_ADDR_ANY, 80);
    netconn_listen(conn);

    puts("[http_server] Listening on port 80......\r\n");

    while (1) {
        // Accept new connections
        if (netconn_accept(conn, &newconn) == ERR_OK) {
            puts("[http_server] New tcp connection established\n");
            httpd_handler(newconn);
            netconn_delete(newconn);
            puts("[http_server] Tcp connection closed successfully\n");
        }
        else {
            puts("[http_server] Couldn't establish tcp connection\n");
        }
    }
}
////////////////////////////////////////////////////////////////

static void startWebserver() {
    puts("Start http server thread...\r\n");
    sys_thread_new("http_server", (lwip_thread_fn) &http_server, NULL, 4000, (( 32 ) - 2));
}

static void stopWebserver() {
    
}

static void event_cb_wifi_event(input_event_t *event, void *private_data)
{
    static char *ssid;
    static char *password;

    switch (event->code) {
        case CODE_WIFI_ON_INIT_DONE:
        {
            printf("[APP] [EVT] INIT DONE %lld\r\n", aos_now_ms());
            wifi_mgmr_start_background(&conf);
        }
        break;
        case CODE_WIFI_ON_MGMR_DONE:
        {
            printf("[APP] [EVT] MGMR DONE %lld, now %lums\r\n", aos_now_ms(), bl_timer_now_us()/1000);
            _connect_wifi();
        }
        break;
        case CODE_WIFI_ON_MGMR_DENOISE:
        {
            printf("[APP] [EVT] Microwave Denoise is ON %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_ON_SCAN_DONE:
        {
            printf("[APP] [EVT] SCAN Done %lld\r\n", aos_now_ms());
            wifi_mgmr_cli_scanlist();
        }
        break;
        case CODE_WIFI_ON_SCAN_DONE_ONJOIN:
        {
            printf("[APP] [EVT] SCAN On Join %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_ON_DISCONNECT:
        {
            printf("[APP] [EVT] disconnect %lld, Reason: %s\r\n",
                aos_now_ms(),
                wifi_mgmr_status_code_str(event->value)
            );
        }
        break;
        case CODE_WIFI_ON_CONNECTING:
        {
            printf("[APP] [EVT] Connecting %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_CMD_RECONNECT:
        {
            printf("[APP] [EVT] Reconnect %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_ON_CONNECTED:
        {
            printf("[APP] [EVT] connected %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_ON_PRE_GOT_IP:
        {
            printf("[APP] [EVT] connected %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_ON_GOT_IP:
        {
            printf("[APP] [EVT] GOT IP %lld\r\n", aos_now_ms());
            printf("[SYS] Memory left is %d Bytes\r\n", xPortGetFreeHeapSize());
            startWebserver();
        }
        break;
        case CODE_WIFI_ON_EMERGENCY_MAC:
        {
            printf("[APP] [EVT] EMERGENCY MAC %lld\r\n", aos_now_ms());
            hal_reboot();//one way of handling emergency is reboot. Maybe we should also consider solutions
        }
        break;
        case CODE_WIFI_ON_PROV_SSID:
        {
            printf("[APP] [EVT] [PROV] [SSID] %lld: %s\r\n",
                    aos_now_ms(),
                    event->value ? (const char*)event->value : "UNKNOWN"
            );
            if (ssid) {
                vPortFree(ssid);
                ssid = NULL;
            }
            ssid = (char*)event->value;
        }
        break;
        case CODE_WIFI_ON_PROV_BSSID:
        {
            printf("[APP] [EVT] [PROV] [BSSID] %lld: %s\r\n",
                    aos_now_ms(),
                    event->value ? (const char*)event->value : "UNKNOWN"
            );
            if (event->value) {
                vPortFree((void*)event->value);
            }
        }
        break;
        case CODE_WIFI_ON_PROV_PASSWD:
        {
            printf("[APP] [EVT] [PROV] [PASSWD] %lld: %s\r\n", aos_now_ms(),
                    event->value ? (const char*)event->value : "UNKNOWN"
            );
            if (password) {
                vPortFree(password);
                password = NULL;
            }
            password = (char*)event->value;
        }
        break;
        case CODE_WIFI_ON_PROV_CONNECT:
        {
            printf("[APP] [EVT] [PROV] [CONNECT] %lld\r\n", aos_now_ms());
            printf("connecting to %s:%s...\r\n", ssid, password);
            wifi_sta_connect(ssid, password);
        }
        break;
        case CODE_WIFI_ON_PROV_DISCONNECT:
        {
            printf("[APP] [EVT] [PROV] [DISCONNECT] %lld\r\n", aos_now_ms());
        }
        break;
        case CODE_WIFI_ON_AP_STA_ADD:
        {
            printf("[APP] [EVT] [AP] [ADD] %lld, sta idx is %lu\r\n", aos_now_ms(), (uint32_t)event->value);
            startWebserver();
        }
        break;
        case CODE_WIFI_ON_AP_STA_DEL:
        {
            printf("[APP] [EVT] [AP] [DEL] %lld, sta idx is %lu\r\n", aos_now_ms(), (uint32_t)event->value);
            stopWebserver();
        }
        break;
        default:
        {
            printf("[APP] [EVT] Unknown code %u, %lld\r\n", event->code, aos_now_ms());
            /*nothing*/
        }
    }
}

